===============================================================
SELECT 1_users.fio, 1_users.user_group, 1_log.ip FROM 1_log LEFT JOIN 1_users ON 1_log.manager = 1_users.id WHERE 1_log.ip != "" AND 1_log.ip NOT LIKE "192.168.200%" AND 1_log.ip NOT LIKE "5.79.218%" AND 1_log.ip NOT LIKE "62.165.38%"

- определение - внутри ли ты
===============================================================

Права доступа:

brands:
["*"] - все бренды, все способности
["-"] - все бренды, но не может открывать клиентов в чужом бренде
[1,2,3] - перечень брендов с полным доступом
["0"] - не может выключать фильтр по себе

===============================================================